<template>
  <div class="container py-24 mx-auto md:px-6">
    <!-- Section: Design Block -->
    <section>
      <h1 class="mb-4 text-3xl font-bold">
        О консорциуме
      </h1>

      <p class="mb-6">
        Консорциум «Индустрия 4.0» (далее – Консорциум) был создан, согласно законодательству Республики Казахстан, между аффилированным центром четвертой промышленной революции ЧК «Tech Hub Limited», в лице и.о. Генерального директора Нуркамалова Ф.С., действующего на основании Устава, (далее – Аффилированный центр 4ПР), объединением юридических лиц «Казахстанская Ассоциация Цифровой Энергетики» (далее – Ассоциация), в лице Председателя Ассоциации Ильяс Б.Н., действующего на основании Устава, а также заинтересованными юридическими лицами (далее – Организации), которые добровольно присоединятся к Консорциуму (далее совместно именуемые – Участники), в целях объединения усилий и ресурсов для развития топливно-энергетического комплекса, технологических компетенций и внедрения элементов Индустрии 4.0 в энергетическую отрасль Республики Казахстан.
      </p>

      <p class="mb-6 flex items-center font-bold uppercase text-danger dark:text-danger-500">
        <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor"
             class="mr-2 h-5 w-5">
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M15.362 5.214A8.252 8.252 0 0112 21 8.25 8.25 0 016.038 7.048 8.287 8.287 0 009 9.6a8.983 8.983 0 013.361-6.867 8.21 8.21 0 003 2.48z" />
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M12 18a3.75 3.75 0 00.495-7.467 5.99 5.99 0 00-1.925 3.546 5.974 5.974 0 01-2.133-1A3.75 3.75 0 0012 18z" />
        </svg>ОБЩИЕ ПОЛОЖЕНИЯ
      </p>

      <p class="mb-6">
        1.1 Консорциум представляет собой добровольное объединение Аффилированного центра 4ПР, Ассоциации и Организаций, в лице отраслевых ассоциаций, представителей энергетической отрасли и IT сообщества, отечественных товаропроизводителей и бизнес-сообщества, научно-исследовательских и образовательных организаций, международных организаций и технологических компании, а также организаций квазигосударственного сектора и иностранных государств.
      </p>

      <p class="mb-6">
        1.2 Цели Консорциума
      </p>

      <ul class="mb-6 list-inside list-disc">
        <li>Формирование политики по внедрению элементов Индустрии 4.0 в энергетическую отрасль Республики Казахстан (далее - РК);</li>
        <li>Привлечение промышленных партнеров, инвесторов и поставщиков технологических решений к использованию преимуществ, особенностей и специфики Международного финансового центра «Астана» для возможности разработки нормативных стандартов;</li>
        <li>Создание баз данных местных и международных партнеров в области бизнеса и промышленности;</li>
        <li>Создание инновационной экосистемы на основе международной политики, принципов и правил в области управления новыми технологиями.</li>
      </ul>

      <p>1.3 Настоящий Консорциум не создает для Участников каких-либо имущественных и финансовых обязательств, а также не устанавливает ограничений их деятельности в соответствии с уставами.</p>
      <p>1.4 Лидером консорциума является Аффилированный центр 4ПР, а координатором Консорциума является Ассоциация (далее – «Лидер» и «Координатор» соответственно), которые для достижения целей являются связующими звеньями между Участниками Консорциума и Центром четвертой промышленной революции, базирующимся в Сан-Франциско, США (далее – Центр 4ПР).</p>
      <p>1.5 Коммерческая деятельность Участников Консорциума строится на основании дополнительных соглашений к настоящему соглашению, заключенных между ними в рамках целевых проектов, направленных на достижение целей Консорциума.</p>
      <p>1.6 Целевые проекты, мероприятия и работы, реализуемые на базе Консорциума, результаты совместной деятельности, распределение доходов от использования результатов совместной деятельности (в т.ч. интеллектуальной собственности) определяются на основе дополнительных соглашений к настоящему соглашению.</p>

      <p class="my-6 flex items-center font-bold uppercase text-danger dark:text-danger-500">
        <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor"
             class="mr-2 h-5 w-5">
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M15.362 5.214A8.252 8.252 0 0112 21 8.25 8.25 0 016.038 7.048 8.287 8.287 0 009 9.6a8.983 8.983 0 013.361-6.867 8.21 8.21 0 003 2.48z" />
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M12 18a3.75 3.75 0 00.495-7.467 5.99 5.99 0 00-1.925 3.546 5.974 5.974 0 01-2.133-1A3.75 3.75 0 0012 18z" />
        </svg>ЗАДАЧИ ДЕЯТЕЛЬНОСТИ КОНСОРЦИУМА
      </p>

      <p class="mb-6">
        2.1 Задачами Консорциума является:
      </p>

      <ul class="mb-6 list-inside list-disc">
        <li>Реализация проектов по направлению технологии Интернет Вещей (далее IoT) и масштабирование системных инструментов для снижения барьеров, и поощрения внедрения промышленных IoT среди малых и средних предприятий;</li>
        <li>Совместная реализация проектов, предусмотренных в Национальном проекте «Технологический рывок за счет цифровизации, науки и инноваций», утвержденных постановлением Правительства Республики Казахстан от 12 октября 2021 года № 727;</li>
        <li>Участие в разработке концепции в области структурирования баз данных технологии Политики данных;</li>
        <li>Реализация проекта методологии оценки цифровой зрелости Smart Industry Readiness Index для оценки цифровой зрелости промышленных предприятий;</li>
        <li>Совместная реализация пилотных проектов в рамках Умного города путем взаимодействия с представителями Всемирного Экономического Форума (далее – «ВЭФ») и Альянса Умных Городов «G-20», проекта, реализуемого на базе ВЭФ;</li>
        <li>Совместная разработка поправок в законодательство РК по регуляторной песочнице и выработка страновых рекомендаций при поддержке ООН.</li>
      </ul>

      <p class="mb-6">
        2.2 Основными направлениями сотрудничества и совместной деятельности, в рамках которых создается Консорциум, Участники определяют следующие:
      </p>

      <ul class="mb-6 list-inside list-disc">
        <li>Совместная организация мероприятий для презентации будущих проектов Консорциума;</li>
        <li>Создание совместных рабочих групп для реализации проектов Консорциума и разработка рекомендаций по преодолению технологических и нормативных барьеров в области внедрения элементов Индустрии 4.0 в энергетическую отрасль РК;</li>
        <li>Подготовка аналитических справок по международному опыту реализации аналогичных целевых проектов путем направления запросов ВЭФ;</li>
        <li>Совместная разработка концептуальных документов и проектов поправок в действующие нормативно-правовые акты РК;</li>
        <li>Взаимодействие с представителями ВЭФ и Международного Альянса «Умных Городов» G-20;  </li>
        <li>Совместная реализация пилотных проектов для апробации инновационных продуктов с участием членов Ассоциации;</li>
        <li>Масштабирование положительного опыта совместной деятельности.</li>
      </ul>

      <p class="my-6 flex items-center font-bold uppercase text-danger dark:text-danger-500">
        <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor"
             class="mr-2 h-5 w-5">
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M15.362 5.214A8.252 8.252 0 0112 21 8.25 8.25 0 016.038 7.048 8.287 8.287 0 009 9.6a8.983 8.983 0 013.361-6.867 8.21 8.21 0 003 2.48z" />
          <path stroke-linecap="round" stroke-linejoin="round"
                d="M12 18a3.75 3.75 0 00.495-7.467 5.99 5.99 0 00-1.925 3.546 5.974 5.974 0 01-2.133-1A3.75 3.75 0 0012 18z" />
        </svg>УПРАВЛЕНИЕ ДЕЯТЕЛЬНОСТЬЮ КОНСОРЦИУМА
      </p>

      <p>3.1 Целевые проекты на базе Консорциума рассматриваются Участниками совместно, реализуются путем создания экспертных и/или рабочих групп по отдельным проектам или направлениям деятельности. Решения подлежат утверждению Лидером Консорциума по согласованию с Координатором Консорциума в рабочем порядке.</p>

      <p class="mb-6">
        3.2 Участники Консорциума имеют право:
      </p>

      <ul class="mb-6 list-inside list-disc">
        <li>участвовать в оценке и обсуждении технологий, инноваций, IT продуктов, вносить предложения по их доработке;</li>
        <li>обращаться за консультацией к Лидеру и Координатору Консорциума по вопросам реализации проектов и программ;</li>
        <li>выдвигать инициативы и вопросы на повестку совместных мероприятий экспертных и рабочих групп;</li>
        <li>предлагать к реализации участниками Консорциума технологические программы, цифровые продукты, программы стажировок и иных форматов взаимовыгодного соотрудничества Участников Консорциума;</li>
        <li>заключать отдельные договоры и соглашения с Участником Консорциума и иными юридическими лицами для достижения целей и задач Консорциума;</li>
        <li>проводить мероприятия (рабочие группы, встречи, семинары, вебинары, и пр.) с участием ведущих международных экспертов из обширной сети Центра 4ПР для достижения целей и задач Консорциума.</li>
      </ul>

      <p class="mb-6">
        3.3 Участники Консорциума договорились:
      </p>

      <ul class="mb-6 list-inside list-disc">
        <li>содействовать достижению цели и решению задач Консорциума, соблюдать настоящее Соглашение;</li>
        <li>прикладывать усилия для участия в реализации проектов Консорциума, которые будут регулироваться дополнительными соглашениями к настоящему Соглашению;</li>
        <li>оказывать экспертную поддержку Участникам в рамках компетенции и направлять экспертов на совместные мероприятия (рабочие группы, встречи, семинары, вебинары, и пр.);</li>
        <li>участвовать в пилотных проектах и апробациях инновационных технологических программ после их согласования Участниками.</li>
      </ul>


    </section>
    <!-- Section: Design Block -->
  </div>
</template>

<script>
export default {
  name: "about-consortium"
}
</script>

<style scoped>

</style>
