<template>
  <div class="container py-24 mx-auto md:px-6">
    <!-- Section: Design Block -->
    <section class="text-center md:text-left">
      <h2 class="mb-12 text-center text-3xl font-bold">Члены ассоциации</h2>

      <div v-for="item in associations.data" class="mb-6 flex flex-wrap">
        <div class="mb-6 ml-auto w-full shrink-0 grow-0 basis-auto px-3 md:mb-0 md:w-3/12">
          <div class="relative mb-6 overflow-hidden rounded-lg bg-cover bg-no-repeat shadow-lg dark:shadow-black/20"
               data-te-ripple-init data-te-ripple-color="light">
            <img :src="getImageUrlFromBack(item.attributes.image.data.attributes.url)" class="w-full" :alt="item.attributes.title" />
            <a href="#!">
              <div
                class="absolute top-0 right-0 bottom-0 left-0 h-full w-full overflow-hidden bg-fixed opacity-0 transition duration-300 ease-in-out hover:opacity-100 bg-[hsla(0,0%,98.4%,.15)]">
              </div>
            </a>
          </div>
        </div>

        <div class="mb-6 mr-auto w-full shrink-0 grow-0 basis-auto px-3 md:mb-0 md:w-9/12 xl:w-7/12">
          <h5 class="mb-3 text-lg font-bold">{{ item.attributes.title }}</h5>
          <div
            class="mb-3 flex items-center justify-center text-sm font-medium text-danger dark:text-danger-500 md:justify-start">

            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="2"
                 stroke="currentColor" class="mr-2 h-5 w-5">
              <path stroke-linecap="round" stroke-linejoin="round"
                    d="M12.75 3.03v.568c0 .334.148.65.405.864l1.068.89c.442.369.535 1.01.216 1.49l-.51.766a2.25 2.25 0 01-1.161.886l-.143.048a1.107 1.107 0 00-.57 1.664c.369.555.169 1.307-.427 1.605L9 13.125l.423 1.059a.956.956 0 01-1.652.928l-.679-.906a1.125 1.125 0 00-1.906.172L4.5 15.75l-.612.153M12.75 3.031a9 9 0 00-8.862 12.872M12.75 3.031a9 9 0 016.69 14.036m0 0l-.177-.529A2.25 2.25 0 0017.128 15H16.5l-.324-.324a1.453 1.453 0 00-2.328.377l-.036.073a1.586 1.586 0 01-.982.816l-.99.282c-.55.157-.894.702-.8 1.267l.073.438c.08.474.49.821.97.821.846 0 1.598.542 1.865 1.345l.215.643m5.276-3.67a9.012 9.012 0 01-5.276 3.67m0 0a9 9 0 01-10.275-4.835M15.75 9c0 .896-.393 1.7-1.016 2.25" />
            </svg>
            <a :href="item.attributes.website" target="_blank">{{item.attributes.website}}</a>
          </div>
          <!--          <p class="mb-6 text-neutral-500 dark:text-neutral-300">-->
          <!--            <small>Published <u>13.01.2022</u> by-->
          <!--              <a href="#!">Anna Maria Doe</a></small>-->
          <!--          </p>-->
          <p class="text-neutral-500 dark:text-neutral-300">
            {{item.attributes.description}}
          </p>
        </div>
      </div>

    </section>
    <!-- Section: Design Block -->
  </div>
</template>

<script>
import constants from "~/helpers/constants";
export default {
  name: "associations",
  data() {
    return {
      // associations: [
      //   {
      //     title: 'CROCOS',
      //     imgUrl: 'crocos.png',
      //     webSite: 'https://crocos.kz/',
      //     description: 'CROCOS - лидер в области цифровых технологий и интеграции решений. Наша компания с 2011 года успешно разрабатывает и внедряет высококачественные digital-продукты. Мы специализируемся на веб-разработке и интеграции, создании мобильных приложений и поддержке интернет-проектов.'
      //   },
      //   {
      //     title: 'KazPromScan',
      //     imgUrl: 'kazpromscan.png',
      //     webSite: 'https://kazpromscan.com/',
      //     description: 'TOO «KazPromScan» является аттестованной организацией уполномоченным органом в области промышленной безопасности на проведение экспертизы промышленной безопасности.'
      //   },
      //   {
      //     title: 'Networks Energy',
      //     imgUrl: 'network.png',
      //     webSite: 'https://networksenergy.kz/',
      //     description: 'Networks Energy с 2014 года занимается разработкой программного обеспечения в транспортно-логистической, финансовой и иных смежных сферах. А также является разработчиком системы АСУ ДКР и имеет многолетний опыт работы в сфере грузоперевозок и железнодорожных автоматизированных систем.'
      //   },
      //   {
      //     title: 'QZlab',
      //     imgUrl: 'qzlab.png',
      //     webSite: 'https://qzlab.info/',
      //     description: 'QZlab основана в 2019 году и является поставщиком инновационного программного обеспечения в области систем автоматизации производства и корпоративного управления. Компания является резидентом Astana hub.'
      //   },
      //   {
      //     title: 'Smart Energy Hub',
      //     imgUrl: 'smartenergy.png',
      //     webSite: 'https://smart-e.kz/',
      //     description: 'ТОО «Smart Energy Hub» было создано в целях реализации задач, поставленных в Послании народу Казахстана «Стратегия – 2050: Новый политический курс состоявшегося государства», в частности, для повышения конкуренции, качества оказания услуг, а также создания условий для надежного энергоснабжения.'
      //   },
      //   {
      //     title: 'Объединённая ЭнергоCервисная Компания',
      //     imgUrl: 'besk.png',
      //     webSite: 'https://besk.kz/ru/',
      //     description: 'Основным видом деятельности АО «Объединённая ЭнергоCервисная Компания» является передача электрической энергии. АО «ОЭСК» обслуживает территорию Восточно-Казахстанской области. В области 15 сельских районов, 10 городов, 872 поселка и села, 254 сельских и аульных округа. Протяженность сетей предприятия составляет 34 479 км. Площадь обслуживаемой территории – 283 300 квадратных километров. Количество трансформаторных подстанций 35 кВ и выше – 313 шт., количество ТП, КТП, РП, ЦРП – 6 514 шт., количество точек учета – 476 506. Активы компании превышают 230854 условных единиц. Их обслуживанием занимается более 3000 сотрудников.'
      //   },
      //   {
      //     title: 'Астана-Теплотранзит',
      //     imgUrl: 'atranzit.png',
      //     webSite: 'https://a-tranzit.kz/',
      //     description: 'Основным видом деятельности является передача и распределения тепловой энергии. Главной задачей деятельности АО «Астана-Теплотранзит» является бесперебойное и качественное обеспечение всех потребителей города тепловой энергией.'
      //   },
      //   {
      //     title: 'Астанинская ЭнергоСбытовая Компания',
      //     imgUrl: 'aesc.png',
      //     webSite: 'https://aesc.kz/ru/',
      //     description: 'ТОО «Астанинская ЭнергоСбытовая Компания» (АЭСК) было создано в целях реализации задач, поставленных Главой государства Н.Назарбаевым в своем Послании народу Казахстана «Стратегия-2050: новый политический курс состоявшегося государства», в частности, для повышения качества оказания услуг населению, а также создания условий для надежного энергоснабжения потребителей столицы при непосредственном участии Акимата города Астаны в составе АО «Астанаэнергосервис».'
      //   },
      //   {
      //     title: 'AGT Global',
      //     imgUrl: 'aqtglobal.png',
      //     webSite: 'https://agtglobal.kz/',
      //     description: 'Технологические разработки, научные проекты и исследования, бизнес мероприятия, инновационный конкурс OPEN SPACE. AGT Global объединяет науку инженерной мысли, новейшие технологические разработки и глубокую экспертизу, успешно налаживая связи между наукой и производством, разрабатывают научные решения в рамках высокотехнологичных проектов.'
      //   },
      //   {
      //     title: 'Astana IT University',
      //     imgUrl: 'astanait.png',
      //     webSite: 'https://astanait.edu.kz/',
      //     description: 'Миссия Astana IT University — обеспечить цифровую трансформацию через обучение, исследования и успешные инновации. Глобальная цель — подготовка высококвалифицированных специалистов в области цифровой экономики на основе междисциплинарных технологий.'
      //   },
      //   {
      //     title: 'DS GROUP',
      //     imgUrl: 'dsgroup.png',
      //     webSite: 'https://dsgroup.kz/',
      //     description: 'Компания «DS GROUP» основана в 2007 году и является динамично развивающейся компанией с высоким потенциалом. За время работы компанией накоплен богатый опыт работы в проведении обследований, монтажных и пуско-наладочных работ, проектирования, согласования проектов, прохождения различных экспертиз с оформлением полного пакета документов. К настоящему времени реализовано более 35 проектов по автоматизации объектов энергетики Республики Казахстан.'
      //   },
      //   {
      //     title: 'Gem Cyber Security',
      //     imgUrl: 'gemsc.png',
      //     webSite: 'https://gemcs.kz/',
      //     description: 'Gem Cyber Security предоставляет обширный спектр услуг, процедур и решений по внедрению, построению и сопровождению решений защиты от любых угроз ИТ-инфраструктуре – от аудита существующих систем безопасности и формирования плана их развития до создания комплексных решений управления информационной безопасности, а также оказываем консалтинговые и инжиниринговые услуги с целью содействия предприятиям горнодобывающей, металлургической и нефтяной отрасли в вопросах цифровой трансформации бизнеса, построения и модернизации информационно-телекоммуникационной инфраструктуры.'
      //   },
      //   {
      //     title: 'LED Solutions',
      //     imgUrl: 'ledsolutions.png',
      //     webSite: 'http://ledsolutions.kz/',
      //     description: 'Компания основана в 2010 г. и имеет современный производственный завод (более 2 700 м2). Завод расположен в СЭЗ «Астана — новый город», которая предполагает налоговые и таможенные преференции для производственников. Мы предлагаем комплексные решения в области профессионального освещения, поставляя нашим клиентам высококачественные осветительные приборы с гарантией 10 лет. LED Solutions является ведущей в Центральной Азии инновационной компанией в области светодиодного освещения и полупроводниковых решений для беспроводного и энергетического применения.'
      //   },
      //   {
      //     title: 'Real Soft',
      //     imgUrl: 'realsoft.png',
      //     webSite: 'https://realsoft.kz/',
      //     description: 'Компания «Real Soft» была основана в 2000 году и в настоящий момент является одним из лидеров ИТ-индустрии Казахстана и вместе с тем крупнейшим предприятием на рынке предоставления информационных программ на внутреннем рынке. Наша компания обладает всеми необходимыми материальными, техническими, технологическими и людскими ресурсами и призвана решать задачи бизнеса любых компаний с помощью современных IT-технологий.'
      //   },
      //   {
      //     title: 'Data Platform',
      //     imgUrl: 'dataplatform.png',
      //     webSite: 'https://data-platform.ru/',
      //     description: 'Мы разрабатываем программное обеспечение для социально-значимых направлений (городская среда, благоустройства, проекты раскрытия информации) и регулируемой сферы. Являясь не только амбициозной IT-компанией с собственными уникальными разработками, но и экспертами в энергетике и ЖКХ, мы создаём ПО на стыке технологий и расчётно-аналитических моделей.'
      //   },
      //   {
      //     title: 'Евротехлаб',
      //     imgUrl: 'evrotechlab.png',
      //     webSite: 'https://www.evrotechlab.ru/',
      //     description: 'Евротехлаб - инжиниринговая компания, предлагающая решения по комплексным автоматическим измерительным системам контроля качества жидких и газовых сред в энергетике, нефтехимии, на предприятиях ЦБК, металлургии, водоканалах и других отраслях.'
      //   },
      //   {
      //     title: 'Астанинский электротехнический завод',
      //     imgUrl: 'aetz.png',
      //     webSite: 'https://aetz.kz/',
      //     description: 'ТОО «Астанинский электротехнический завод» - один из ведущих Казахстанских производителей электротехнического оборудования. По наращиванию производства и темпам модернизации предприятия - один из наиболее динамично развивающихся в отрасли. ТОО «Астанинский электротехнический завод» работает на рынке Республики Казахстан с ноября 2009 года и входит в Реестр отечественных товаропроизводителей, работ и услуг.'
      //   },
      //   {
      //     title: 'МИРТЕК',
      //     imgUrl: 'mirtek.png',
      //     webSite: 'https://mirtekgroup.com/',
      //     description: 'Группа компаний «МИРТЕК» — российский разработчик и производитель умных счётчиков и программного обеспечения. Наши продукты объединяют в едином поле данные по электроэнергии, газу, водо- и теплоснабжению.'
      //   },
      //   {
      //     title: 'Астана – Региональная Электросетевая Компания',
      //     imgUrl: 'astrec.png',
      //     webSite: 'https://www.astrec.kz/ru',
      //     description: 'История АО «Астана – Региональная Электросетевая Компания» насчитывает более 40 лет и берет свое начало с 1980 года. Именно тогда на базе Акмолинского городского района электрических сетей в соответствии с приказом Производственного энергетического объединения ЭО «Целинэнерго» №244 от 06.08.1980г.   образовано предприятие «Городские электрические сети». В 2010 году предприятие получило статус компании, обслуживающей электросети регионального уровня, в связи с чем переименовано в АО «Астана - Региональная Электросетевая Компания».'
      //   },
      //   {
      //     title: 'KoktemTech',
      //     imgUrl: 'koktem.png',
      //     webSite: 'www.koktem2.kz',
      //     description: 'Компания ТОО «KoktemTech» является молодой компанией, разрабатывающая программные обеспечения в области охраны окружающей среды, направленные на автоматизацию работы уполномоченных государственных органов и экологов на предприятии в Республике Казахстан.\n' +
      //       'Компания является резидентом «Almaty Tech Garden» и «Astana Hub», имеется Лицензия на экологическое проектирование и нормирование, а также Лицензия на экологический аудит.'
      //   },
      //   {
      //     title: 'Prime Energy Resources',
      //     imgUrl: 'primeenergy.png',
      //     webSite: 'https://primeenergy.kz/',
      //     description: 'TOO «Prime Energy Resources» является крупным и динамично развивающимся частным конгломератом, оказывающий услуги снабжения электрической энергией самых крупных производственных и торгово-развлекательных объектов на всей территории Казахстана с 2016 года.\n' +
      //       'Компания осуществляет свою деятельность на основании Государственной лицензии в сфере: Покупка электрической энергии в целях энергоснабжения.'
      //   },
      //   {
      //     title: 'Smart Energy Solutions',
      //     imgUrl: 'smarte.png',
      //     webSite: '#',
      //     description: 'ТОО «Smart Energy Solutions» оказывет услуги: электротехническая экспертиза, консалтинг в сфере энергетики, аналитика данных (Python), визуализация данных (Power BI), участие в стартапе (расширенная инфраструктура измерений как элемент Smart Grid), внедрение инновационных решений в энергетике на основе аналитики и визуализации данных.'
      //   },
      //   {
      //     title: 'Вавиот Азия',
      //     imgUrl: 'waviot.png',
      //     webSite: 'https://lk.waviot.kz/',
      //     description: 'ТОО «Вавиот Азия» является лидером отечественного рынка IoT/Smart Metering с применением сетей по технологии LPWAN (NB-IoT). Комплексный подход от производства/продажи «умных» счетчиков до услуг программной обработки данных позволил накопить самый большой парк обслуживаемых счетчиков ЖКХ – более 400 тыс. точек учета водных и энергетических ресурсов в крупных и больших городах Казахстана. Разработанная данной компанией информационно-измерительная система Интернета вещей «WAVIoT» (ИИС IoT «WAVIoT») является первой и единственной в настоящее время в этом сегменте информационных систем, на которую Комитетом по информационной безопасности МЦРИАП выдан акт о положительных результатах прохождения испытаний на соответствие требованиям информационной безопасности.'
      //   },
      //   {
      //     title: 'Астана Энергия',
      //     imgUrl: 'astanaenergy.png',
      //     webSite: 'https://astana-energy.kz/ru/',
      //     description: 'В конце декабря 1961 года была введена Акмолинская ТЭЦ-1 с пуском в эксплуатацию первой турбины и первого котла.\n' +
      //       '29 июня 1971 года было принято специальное решение Министерства энергетики СССР по разработке технического проекта Целиноградской ТЭЦ-2.\n' +
      //       'С момента ввода станций ТЭЦ-1, ТЭЦ-2 выработано более 72 млрд. кВт.час электрической энергии по состоянию 31.12.2020г.'
      //   },
      //   {
      //     title: 'Самрук-Энерго',
      //     imgUrl: 'samrukenergy.png',
      //     webSite: 'https://www.samruk-energy.kz/ru/',
      //     description: 'В целях выработки и реализации долгосрочной государственной политики по модернизации существующих и вводу новых генерирующих мощностей 18 апреля 2007 года решением общего собрания учредителей было создано Акционерное общество «Самрук-Энерго» (далее – АО «Самрук-Энерго» или Общество). Учредителями Общества в момент его создания являлись АО «Казахстанский холдинг по управлению государственными активами «Самрук» и АО «КазТрансГаз».'
      //   },
      //   {
      //     title: 'Alageum Electric',
      //     imgUrl: 'alageum.png',
      //     webSite: 'https://alageum.com/ru/',
      //     description: '«Alageum Electric» – крупная электротехническая компания Казахстана, включает в себя более 30-ти крупных предприятий и заводов, успешно действующих в сфере электроэнергетики, электромашиностроения и строительства. В числе таких предприятий – Кентауский Трансформаторный Завод (г. Кентау), и специализированная компания АО «Электромонтаж», выполняющая электромонтажные работы любой сложности, имеющую богатейший опыт и 10 специализированных монтажных управлений, включая «Завод электромонтажных изделий», единственное предприятие в Казахстане, которое производит системы кабельных трасс.'
      //   }
      // ]
    }
  },
  async asyncData({$axios}) {
    const associations = await $axios.$get(constants.baseApiUrl + '/associations?populate=*')
    return {associations}
  },
  methods: {
    // getImageUrl(url) {
    //   return require(`~/assets/images/associations/${url}`)
    // },
    getImageUrlFromBack(url) {
      return constants.baseUrl+url;
    }
  }
}
</script>

<style scoped>

</style>
